### Pandas Exercises

Exercise 1

In [2]:
import pandas as pd
import numpy as np
import random
import pandas.testing as tm
Sample_data = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

df = pd.DataFrame(Sample_data)
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Exercise 2

In [3]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Exercise 3

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 700.0+ bytes

Exercise 4

In [5]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Exercise 5

In [6]:
df.loc[:,['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

Exercise 6

In [7]:
df.loc[['b','d','f','g'],['score','qualify']]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

Exercise 7

In [8]:
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Exercise 8

In [9]:
df.shape

(10, 4)

Exercise 9

In [10]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

Exercise 10

In [11]:
df[(df['score']>15) & (df['score']<=20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

Exercise 11

In [12]:
df[(df["attempts"]<2) & (df["score"]>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

Exercise 12

In [13]:
df.loc['d','score'] = 11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Exercise 13

In [14]:
print(f'Sum of the examination attempts by the students: {df["attempts"].sum()}')

Sum of the examination attempts by the students: 19

Exercise 14

In [15]:
print(f'Sum of the examination attempts by the students: {df["score"].mean():.2f}')

Sum of the examination attempts by the students: 13.33

Exercise 15

In [16]:
# df.loc["k"] = [1, 'Suresh', 'yes', 15.5]
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Exercise 16

In [17]:
df = df.sort_values(by=['name','score'], ascending=[False, True])
df

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

Exercise 17

In [18]:
df

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

Exercise 18

In [19]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df= pd.DataFrame(exam_data , index=labels)

df[df["name"]== "James"] = "Suresh"
df

C:\Users\Caio\AppData\Local\Temp\ipykernel_19000\2240152513.py:9: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Suresh' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df[df["name"]== "James"] = "Suresh"
C:\Users\Caio\AppData\Local\Temp\ipykernel_19000\2240152513.py:9: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Suresh' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df[df["name"]== "James"] = "Suresh"

        name   score attempts qualify
a  Anastasia    12.5        1     yes
b       Dima     9.0        3      no
c  Katherine    16.5        2     yes
d     Suresh  Suresh   Suresh  Suresh
e      Emily     9.0        2      no
f    Michael    20.0        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin     8.0        2      no
j      Jonas    19.0        1     yes

Exercise 19

In [20]:
df.drop("attempts", axis=1, inplace=True)
df

        name   score qualify
a  Anastasia    12.5     yes
b       Dima     9.0      no
c  Katherine    16.5     yes
d     Suresh  Suresh  Suresh
e      Emily     9.0      no
f    Michael    20.0     yes
g    Matthew    14.5     yes
h      Laura     NaN      no
i      Kevin     8.0      no
j      Jonas    19.0     yes

Exercise 20

In [21]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']

df["color"] = color
df

        name   score qualify   color
a  Anastasia    12.5     yes     Red
b       Dima     9.0      no    Blue
c  Katherine    16.5     yes  Orange
d     Suresh  Suresh  Suresh     Red
e      Emily     9.0      no   White
f    Michael    20.0     yes   White
g    Matthew    14.5     yes    Blue
h      Laura     NaN      no   Green
i      Kevin     8.0      no   Green
j      Jonas    19.0     yes     Red

Exercise 21

In [22]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]

df = pd.DataFrame(exam_data)
for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

Exercise 22

In [23]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
for i in list(df.columns):
    print(i)

name
score
attempts
qualify

Exercise 23

In [24]:
arr = np.arange(1,10).reshape(3,3)
colun = ['col1','col2','col3']

df = pd.DataFrame(arr, columns=colun)
df.rename(columns={'col1':'Column1','col2':'Column2','col3':'Column3'}, inplace=True)
df

   Column1  Column2  Column3
0        1        2        3
1        4        5        6
2        7        8        9

Exercise 24

Exercise 25

In [25]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Exercise 26

In [26]:
new_row = [10,11,12]
df.loc[5] = new_row
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

Exercise 27

In [27]:
df.to_csv('my_data.csv', index=False,sep='\t')

Exercise 28

In [28]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
df1.groupby(['city']).count()

             name
city
California      4
Georgia         2
Los Angeles     4

Exercise 29

In [29]:
df = df[df['col2'] != 5]
df

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

Exercise 30

Exercise 31

In [30]:
df.iloc[:,0:2]

   col1  col2
0     1     4
2     3     6
3     4     7
4     5     8
5    10    11

Exercise 32

In [31]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df_exe32 = pd.DataFrame(exam_data)
df_exe32['score'].fillna(0, inplace=True)
df_exe32

C:\Users\Caio\AppData\Local\Temp\ipykernel_19000\1199754823.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_exe32['score'].fillna(0, inplace=True)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Exercise 33

In [32]:
df_exe33 = df_exe32.copy()
df_exe33['id'] = df_exe33.index
df_exe33

        name  score  attempts qualify  id
0  Anastasia   12.5         1     yes   0
1       Dima    9.0         3      no   1
2  Katherine   16.5         2     yes   2
3      James    0.0         3      no   3
4      Emily    9.0         2      no   4
5    Michael   20.0         3     yes   5
6    Matthew   14.5         1     yes   6
7      Laura    0.0         1      no   7
8      Kevin    8.0         2      no   8
9      Jonas   19.0         1     yes   9

Exercise 34

In [33]:
df_exe34 = df_exe32.copy()
df_exe34.set_value(8, 'score', 10.2)
df_exe34

AttributeError: 'DataFrame' object has no attribute 'set_value'

Exercise 35

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df_exe35 = pd.DataFrame(exam_data)
df_exe35.isnull().value_counts()

name   score  attempts  qualify
False  False  False     False      8
       True   False     False      2
Name: count, dtype: int64

Exercise 36

In [ ]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df_exe36 = pd.DataFrame(data=d)
df_exe36.drop([2,4],inplace=True)
df_exe36

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

Exercise 37

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df_exe37 = pd.DataFrame(exam_data)
df_exe37.drop([0,1],inplace=True)
df_exe37.reset_index()
df_exe37

        name  score  attempts qualify
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Exercise 38

In [ ]:
df_exe38 = pd.DataFrame(np.random.randn(10, 2))
print("Original DataFrame:")
print(df)
part_70 = df.sample(frac=0.7,random_state=10)
part_30 = df.drop(part_70.index)
print("\n70% of the said DataFrame:")
print(part_70)
print("\n30% of the said DataFrame:")
print(part_30)

Original DataFrame:
   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

70% of the said DataFrame:
   col1  col2  col3
3     4     7     0
4     5     8     1
0     1     4     7
5    10    11    12

30% of the said DataFrame:
   col1  col2  col3
2     3     6     9

Exercise 39

In [ ]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
df_exe39 = pd.concat([s1, s2], axis=1)
df_exe39

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

Exercise 40

In [ ]:
df_exe40 = pd.DataFrame(exam_data)
df_exe40.sample(frac=2, replace=True, random_state=1)

        name  score  attempts qualify
5    Michael   20.0         3     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
5    Michael   20.0         3     yes
0  Anastasia   12.5         1     yes
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
9      Jonas   19.0         1     yes
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
7      Laura    NaN         1      no
7      Laura    NaN         1      no
9      Jonas   19.0         1     yes

Exercise 41

In [ ]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
s = pd.to_datetime(s)
df_exe41 = pd.DataFrame(s)
df_exe41

           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

Exercise 42

In [ ]:
col = ["col1", "col2", "col3"]
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
df_exe42 = pd.DataFrame(data, columns=col)
df_exe42.rename(columns={"col2": "column2"}, inplace=True)
df_exe42

   col1  column2  col3
0     1        2     3
1     4        5     6
2     7        8     9

Exercise 43

In [ ]:
for i in df_exe42["column2"]:
    print(i)

2
5
8

Exercise 44

In [ ]:
values = np.zeros(15)
index = ['Index'+str(i) for i in range(1, len(values)+1)]
df_exe44 = pd.DataFrame(values, index=index)
df_exe44

           0
Index1   0.0
Index2   0.0
Index3   0.0
Index4   0.0
Index5   0.0
Index6   0.0
Index7   0.0
Index8   0.0
Index9   0.0
Index10  0.0
Index11  0.0
Index12  0.0
Index13  0.0
Index14  0.0
Index15  0.0

Exercise 45

In [ ]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("Row where col1 has maximum value:")
print(df['col1'].argmax())
print("Row where col2 has maximum value:")
print(df['col2'].argmax())
print("Row where col3 has maximum value:")
print(df['col3'].argmax())

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Row where col1 has maximum value:
4
Row where col2 has maximum value:
3
Row where col3 has maximum value:
2

Exercise 46

In [ ]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
if 'col4' in df.columns:
  print("Col4 is present in DataFrame.")
else:
  print("Col4 is not present in DataFrame.")
if 'col1' in df.columns:
  print("Col1 is present in DataFrame.")
else:
  print("Col1 is not present in DataFrame.")

np.int64(7)

Exercise 47

In [ ]:
def get_row(row_num,df):
    return df.iloc[row_num]
    
get_row(3,df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Col4 is not present in DataFrame.
Col1 is present in DataFrame.

Exercise 48

In [ ]:
df.info()

col1    4
col2    9
col3    1
Name: 3, dtype: int64

Exercise 49

In [ ]:
df_exe49 = pd.DataFrame()
dic = [{"col1":0,"col2":0},{"col1":1,"col2":1},{"col1":2,"col2":2}]
df_exe49_2 = pd.DataFrame(dic)
df_exe49_2
df49 = pd.concat([df_exe49,df_exe49_2])
df49

   col1  col2
0     0     0
1     1     1
2     2     2

Exercise 50

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df_exe50 = pd.DataFrame(exam_data)
df_exe50.sort_values(by=['name','score'],ascending=[True,True],inplace=True)
df_exe50

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
4      Emily    9.0         2      no
3      James    NaN         3      no
9      Jonas   19.0         1     yes
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
5    Michael   20.0         3     yes

Exercise 51

In [ ]:
df_exe51 = pd.DataFrame(exam_data)
df_exe51['score'] = df_exe51['score'].fillna(0)
df_exe51['score'] = df_exe51['score'].astype(int)
df_exe51.dtypes

name        object
score        int64
attempts     int64
qualify     object
dtype: object

Exercise 52

In [ ]:

df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Original DataFrame:")
print(df)
print("Removing infinite values:")
df = df.replace([np.inf, -np.inf], np.nan)
df = df.replace([1000,2000,3000],1)
print(df)

Original DataFrame:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf
Removing infinite values:
        0
0     1.0
1     1.0
2     1.0
3 -4000.0
4     NaN
5     NaN

Exercise 53

In [ ]:

d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
new_col = [1, 2, 3, 4, 7]  
# insert the said column at the beginning in the DataFrame
idx = 0
df.insert(loc=idx, column='col1', value=new_col)
df

Original DataFrame
   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Exercise 54

In [ ]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]
# sets the headers as list
headers = my_lists.pop(0) 
data = my_lists[0:]
df_exe54 = pd.DataFrame(data, columns=headers)
df_exe54

   col1  col2
0     2     4
1     1     3

Exercise 55

In [ ]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
df.groupby('col1')['col2'].apply(list)

Original DataFrame

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

Exercise 56

In [ ]:
df.columns.get_loc('col2')

1

Exercise 57

In [ ]:
df.columns.size

2

Exercise 58

In [ ]:
df_exe50.loc[:,df_exe50.columns != 'attempts']

        name  score qualify
0  Anastasia   12.5     yes
1       Dima    9.0      no
4      Emily    9.0      no
3      James    NaN      no
9      Jonas   19.0     yes
2  Katherine   16.5     yes
8      Kevin    8.0      no
7      Laura    NaN      no
6    Matthew   14.5     yes
5    Michael   20.0     yes

Exercise 59

In [ ]:

d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nFirst 3 rows of the said DataFrame':")
df1 = df.head(3)
print(df1)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

First 3 rows of the said DataFrame':
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

Exercise 60

In [ ]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nFirst 3 rows of the said DataFrame':")
df1 = df.tail(3)
print(df1)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

First 3 rows of the said DataFrame':
   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

Exercise 61

In [ ]:
df_exe50.reset_index(drop=True,inplace=True)
df_exe50.iloc[:3]

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2      Emily    9.0         2      no

Exercise 62

In [ ]:
df_exe50.reset_index(drop=True,inplace=True)
df_exe50.iloc[3:]

        name  score  attempts qualify
3      James    NaN         3      no
4      Jonas   19.0         1     yes
5  Katherine   16.5         2     yes
6      Kevin    8.0         2      no
7      Laura    NaN         1      no
8    Matthew   14.5         1     yes
9    Michael   20.0         3     yes

Exercise 63

In [ ]:
df_exe50.reset_index(drop=True,inplace=True)
df_exe50.iloc[3:]

        name  score  attempts qualify
3      James    NaN         3      no
4      Jonas   19.0         1     yes
5  Katherine   16.5         2     yes
6      Kevin    8.0         2      no
7      Laura    NaN         1      no
8    Matthew   14.5         1     yes
9    Michael   20.0         3     yes

Exercise 64

In [ ]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
column = []
for i in df.columns:
    column.append("A_"+i)
df.columns = column
df.add_suffix('_1')

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

   A_W_1  A_X_1  A_Y_1  A_Z_1
0     68     78     84     86
1     75     85     94     97
2     86     96     89     96
3     80     80     83     72
4     66     86     86     83

Exercise 65

In [ ]:
print("Reverse Columns: ")
print(df.iloc[:,::-1])

print("Reverse Rows: ")
print(df.iloc[::-1])

Reverse Columns:
   A_Z  A_Y  A_X  A_W
0   86   84   78   68
1   97   94   85   75
2   96   89   96   86
3   72   83   80   80
4   83   86   86   66
Reverse Rows:
   A_W  A_X  A_Y  A_Z
4   66   86   86   83
3   80   80   83   72
2   86   96   89   96
1   75   85   94   97
0   68   78   84   86

Exercise 66

In [ ]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
df.select_dtypes(include=['number', 'object'])
# df.memory_usage(deep=True)

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

Exercise 67

In [ ]:
print("First : " )
print(df.sample(frac=0.5, random_state=1))
print("Second : " )
print(df.sample(frac=0.60, random_state=34))

First :
           name date_of_birth   age
2   Ryan Parkes    25/09/1998  22.5
1  Gino Mcneill    16/02/1999  21.2
Second :
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
4    Syed Wharton    15/09/1997  23.0
3    Eesha Hinton    11/05/2002  22.0

Exercise 68

In [ ]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
df.columns = df.columns.str.strip()
df.columns = df.columns.str.lower()
df.columns

Index(['name', 'date_of_birth', 'age'], dtype='object')

Exercise 69

In [ ]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
df1 = df.sample(frac=0.6,random_state=65)
df2 = df.sample(frac=0.3,random_state=23)
df3 = df.sample(frac=0.4,random_state=99)
print("Sample 1")
print(df1)
print("Sample 2")
print(df2)
print("Sample 3")
print(df3)

df_all = pd.concat([df1,df2,df3],ignore_index=True)
print("All Sample")
print(df_all)
print(df_all.drop_duplicates())
df_all.reset_index(drop=True,inplace=True)
print(df_all)

Sample 1
           Name Date_Of_Birth    Age
2   Ryan Parkes     25/09/1998  22.5
3  Eesha Hinton     11/05/2002  22.0
4  Syed Wharton     15/09/1997  23.0
Sample 2
           Name Date_Of_Birth    Age
4  Syed Wharton     15/09/1997  23.0
1  Gino Mcneill     16/02/1999  21.2
Sample 3
             Name Date_Of_Birth    Age
2     Ryan Parkes     25/09/1998  22.5
0  Alberto Franco     17/05/2002  18.5
All Sample
             Name Date_Of_Birth    Age
0     Ryan Parkes     25/09/1998  22.5
1    Eesha Hinton     11/05/2002  22.0
2    Syed Wharton     15/09/1997  23.0
3    Syed Wharton     15/09/1997  23.0
4    Gino Mcneill     16/02/1999  21.2
5     Ryan Parkes     25/09/1998  22.5
6  Alberto Franco     17/05/2002  18.5
             Name Date_Of_Birth    Age
0     Ryan Parkes     25/09/1998  22.5
1    Eesha Hinton     11/05/2002  22.0
2    Syed Wharton     15/09/1997  23.0
4    Gino Mcneill     16/02/1999  21.2
6  Alberto Franco     17/05/2002  18.5
             Name Date_Of_Birth    Age
0     Ryan Parkes     25/09/1998  22.5
1    Eesha Hinton     11/05/2002  22.0
2    Syed Wharton     15/09/1997  23.0
3    Syed Wharton     15/09/1997  23.0
4    Gino Mcneill     16/02/1999  21.2
5     Ryan Parkes     25/09/1998  22.5
6  Alberto Franco     17/05/2002  18.5

Exercise 70

In [ ]:
data = { 'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
'Age': [18, 22, 40, 50, 80] }

df = pd.DataFrame(data)
df["age_group"] = pd.cut(df["Age"], bins=[0, 18, 39, 99], labels=["kids", "adult", "elderly"])
df
# df.info()

             Name  Age age_group
0  Alberto Franco   18      kids
1    Gino Mcneill   22     adult
2     Ryan Parkes   40   elderly
3    Eesha Hinton   50   elderly
4    Syed Wharton   80   elderly

Exercise 71

In [ ]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
df=pd.DataFrame(df)
df.memory_usage(deep=True)

Index             132
Name              306
Date_Of_Birth     295
Age                40
dtype: int64

Exercise 72

In [ ]:
arr = np.arange(1,6)
arr1 = ['php','python','java','c#','c++']
df = pd.DataFrame(arr)
df1 = pd.DataFrame(arr1)
df_all = pd.concat([df,df1],axis=1)
df_all

   0       0
0  1     php
1  2  python
2  3    java
3  4      c#
4  5     c++

Exercise 73

In [ ]:
### Deprecated

DataFrame: Contains random values:

AttributeError: module 'pandas.testing' has no attribute 'makeDataFrame'

Exercise 74

In [42]:

sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df = df.interpolate()
df

      c1     c2
0  120.0   7.00
1  130.0   8.50
2  140.0  10.00
3  150.0   7.75
4  160.0   5.50
5  170.0  16.50

Exercise 75

In [45]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
maximo =df['W'].max(axis=0)
df[df['X'] >= maximo]

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

    W   X   Y   Z
2  86  96  89  96
4  66  86  86  83

Exercise 76

In [46]:
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
df['purchase'] = df['purchase'].replace('[\$,]', '', regex=True).astype(float)
df

<>:3: SyntaxWarning: invalid escape sequence '\$'
<>:3: SyntaxWarning: invalid escape sequence '\$'
C:\Users\Caio\AppData\Local\Temp\ipykernel_19000\886925164.py:3: SyntaxWarning: invalid escape sequence '\$'
  df['purchase'] = df['purchase'].replace('[\$,]', '', regex=True).astype(float)

  agent  purchase
0  a001   4500.00
1  a002   7500.00
2  a003   3000.25
3  a003   1250.35
4  a004   9000.00

Exercise 77

In [50]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
i,x = pd.factorize(df['Name'])
print(i)
print(x)

[0 1 2 3 1]
Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

Exercise 78

In [ ]:
lista =  [ random.randint(1,1000) for i in range(1, 15)]
lista.sort()
df = pd.DataFrame(lista)
print(df)
print(df.cummax())

      0
0    33
1   138
2   157
3   206
4   267
5   303
6   327
7   340
8   470
9   471
10  479
11  603
12  714
13  811
      0
0    33
1   138
2   157
3   206
4   267
5   303
6   327
7   340
8   470
9   471
10  479
11  603
12  714
13  811

Exercise 79

In [80]:

df = pd.read_clipboard()
print("Data from clipboard to DataFrame:")
print(df)

ParserError: Expected 4 fields in line 3, saw 5. Error could possibly be due to quotes being ignored when a multi-char delimiter is used.

Exercise 80

In [ ]:

df1 = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,85,None,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df2 = pd.DataFrame({'W':[78,75,86,80,None],'X':[78,85,96,80,76], 'Y':[84,84,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrames:")
print(df1)
print(df2)
print("\nCheck for inequality of the said dataframes:")
print(df1.ne(df2))

Original DataFrames:
      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  85.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  83  72
4   NaN  86.0  86  83
      W   X   Y   Z
0  78.0  78  84  86
1  75.0  85  84  97
2  86.0  96  89  96
3  80.0  80  83  72
4   NaN  76  86  83

Check for inequality of the said dataframes:
       W      X      Y      Z
0   True  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False  False
4   True   True  False  False

Exercise 81

In [ ]:

d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
df.nsmallest(3, 'col1')
df.nsmallest(3, 'col2')
df.nsmallest(3, 'col3')

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

   col1  col2  col3
4     7     5     1
1     2     5     5
0     1     4     7